In [2]:
import pandas as pd

# Series

In [3]:
data = [1,2,3,4,5]

In [4]:
s = pd.Series(data)

In [5]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
index = ['Linha ' + str(i) for i in range(5)]

In [7]:
index

['Linha 0', 'Linha 1', 'Linha 2', 'Linha 3', 'Linha 4']

In [8]:
s = pd.Series(data = data, index = index)

In [9]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [51]:
data = {'Linha ' + str(i) : i + 1 for i in range(5)}

In [52]:
data

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [53]:
s = pd.Series(data)

In [54]:
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [55]:
s1 = s + 2

In [56]:
s1

Linha 0    3
Linha 1    4
Linha 2    5
Linha 3    6
Linha 4    7
dtype: int64

In [57]:
s2 = s + s1
s2

Linha 0     4
Linha 1     6
Linha 2     8
Linha 3    10
Linha 4    12
dtype: int64

# DataFrame

In [58]:
data = [[1,2,3], 
        [4,5,6], 
        [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [59]:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [60]:
index = ['Linha ' + str(i + 1) for i in range(3)]

In [61]:
index

['Linha 1', 'Linha 2', 'Linha 3']

In [62]:
df1 = pd.DataFrame(data, index)

In [63]:
df1

         0  1  2
Linha 1  1  2  3
Linha 2  4  5  6
Linha 3  7  8  9

In [64]:
columns = ['Coluna ' + str(i + 1) for i in range(3)]
columns

['Coluna 1', 'Coluna 2', 'Coluna 3']

In [65]:
df1 = pd.DataFrame(data, index, columns)

In [66]:
df1

         Coluna 1  Coluna 2  Coluna 3
Linha 1         1         2         3
Linha 2         4         5         6
Linha 3         7         8         9

In [67]:
data = {'Coluna 1': {'Linha 1': 1, 'Linha 2': 4, 'Linha 3': 7},
        'Coluna 2': {'Linha 1': 2, 'Linha 2': 5, 'Linha 3': 8},
        'Coluna 3': {'Linha 1': 3, 'Linha 2': 6, 'Linha 3': 9}}

In [68]:
data

{'Coluna 1': {'Linha 1': 1, 'Linha 2': 4, 'Linha 3': 7},
 'Coluna 2': {'Linha 1': 2, 'Linha 2': 5, 'Linha 3': 8},
 'Coluna 3': {'Linha 1': 3, 'Linha 2': 6, 'Linha 3': 9}}

In [69]:
df2 = pd.DataFrame(data)
df2

         Coluna 1  Coluna 2  Coluna 3
Linha 1         1         2         3
Linha 2         4         5         6
Linha 3         7         8         9

In [70]:
data = [(1,2,3), 
        (4,5,6), 
        (7,8,9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [71]:
df3 = pd.DataFrame(data, index, columns)

In [72]:
df3

         Coluna 1  Coluna 2  Coluna 3
Linha 1         1         2         3
Linha 2         4         5         6
Linha 3         7         8         9

In [73]:
df1[df1 > 0] = "A"
df1

        Coluna 1 Coluna 2 Coluna 3
Linha 1        A        A        A
Linha 2        A        A        A
Linha 3        A        A        A

In [74]:
df2[df2 > 0] = "B"
df2

        Coluna 1 Coluna 2 Coluna 3
Linha 1        B        B        B
Linha 2        B        B        B
Linha 3        B        B        B

In [75]:
df3[df3 > 0] = "C"
df3

        Coluna 1 Coluna 2 Coluna 3
Linha 1        C        C        C
Linha 2        C        C        C
Linha 3        C        C        C

In [76]:
df4 = pd.concat([df1, df2, df3])
df4

        Coluna 1 Coluna 2 Coluna 3
Linha 1        A        A        A
Linha 2        A        A        A
Linha 3        A        A        A
Linha 1        B        B        B
Linha 2        B        B        B
Linha 3        B        B        B
Linha 1        C        C        C
Linha 2        C        C        C
Linha 3        C        C        C

In [77]:
df4 = pd.concat([df1, df2, df3], axis=1)
df4

,Coluna 1,Coluna 2,Coluna 3,Coluna 1,Coluna 2,Coluna 3,Coluna 1,Coluna 2,Coluna 3
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C
Linha 3,A,A,A,B,B,B,C,C,C

In [80]:
dados = [[1, 2, 3], [4, 5, 6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6